Tekla Open API Reference for Tekla Structures 2025
ShapeItem.GetInstanceCount Method
 Get the number of instances used in the model of a shape
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int GetInstanceCount()
Public Function GetInstanceCount As Integer
Return Value
Type: Int32
 The number of shape instances
Examples
 This sample shows how to call the GetInstanceCount() method to detect shapes without instances thus can be removed.
public List<string> CheckShapeInstancesTest()
{
    var shapeEnumerator = CatalogHandler.GetShapeItems();
    var removedShapes = new List<String>();
    shapeEnumerator.Reset();
    while (shapeEnumerator.MoveNext())
    {
        var shape = shapeEnumerator.Current;
        if (shape.GetInstanceCount() == 0)
        {
            removedShapes.Add(shape.Name);
        }
    }
    return removedShapes;
}
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace